petersho/Arduino_qemu/hardware/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

######################################################
#ARM926EJS Qemu (WITHOUT) BOOTLOADER
sonix_mzero_bl.name=QEMU ARM926EJS
sonix_mzero_bl.vid.0=0x0C45
sonix_mzero_bl.pid.0=0x7600
sonix_mzero_bl.vid.1=0x0C45
sonix_mzero_bl.pid.1=0x5700
sonix_mzero_bl.vid.2=0x0C45
sonix_mzero_bl.pid.2=0x5701
sonix_mzero_bl.upload.tool=openocd
sonix_mzero_bl.upload.protocol=stk500v2
sonix_mzero_bl.upload.maximum_size=262144
sonix_mzero_bl.upload.use_1200bps_touch=true
sonix_mzero_bl.upload.wait_for_upload_port=true
sonix_mzero_bl.upload.native_usb=true
sonix_mzero_bl.upload.speed=57600
sonix_mzero_bl.build.mcu=
sonix_mzero_bl.build.f_cpu=96000000L
sonix_mzero_bl.build.usb_product=
sonix_mzero_bl.build.board=SAMD_SONIX_MZERO_BL
sonix_mzero_bl.build.core=suc7312_cores
sonix_mzero_bl.build.extra_flags=-mthumb {build.usb_flags}
sonix_mzero_bl.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
sonix_mzero_bl.build.openocdscript=openocd_scripts/arduino_zero.cfg
sonix_mzero_bl.build.variant=qemu_arm926
sonix_mzero_bl.build.variant_system_lib=Lib/*.lib
sonix_mzero_bl.build.vid=0x0C45
sonix_mzero_bl.build.pid=0x5701
sonix_mzero_bl.build.preferred_out_format=hex
sonix_mzero_bl.bootloader.size=0x4000
sonix_mzero_bl.build.emu.mcu=


sonix_mzero_bl.menu.upload_method.jLinkMethod=JLink
sonix_mzero_bl.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
sonix_mzero_bl.menu.upload_method.jLinkMethod.upload.protocol=jlink
sonix_mzero_bl.menu.upload_method.jLinkMethod.upload.device=SNC79122A1FG
